// Завдання 1

// "Порівняння кількох промісів"

// Ви маєте набір функцій, які повертають проміси з випадковими затримками. Ваше завдання — виконати всі проміси одночасно за допомогою Promise.all і обробити результати.

// Створіть функцію delayedPromise, яка приймає значення і затримку (у мілісекундах) і повертає проміс, який вирішується з заданим значенням після затримки.
// Створіть масив з 5 промісів, використовуючи функцію delayedPromise, із різними значеннями та затримками.
// Використайте Promise.all, щоб одночасно виконати всі проміси з масиву.
// Обробіть результати вирішення промісів та виведіть їх у консоль.

const delayedPromise = (value, ms) => {
    return new Promise((resolve) => {
        setTimeout(() => {
            resolve(value)
        },ms)
    });
};

const massivPromis = [
  delayedPromise("проміс виконався", 1000),
  delayedPromise("проміс виконався", 2000),
  delayedPromise("проміс виконався", 3000),
  delayedPromise("проміс виконався", 4000),
  delayedPromise("проміс виконався", 5000),
];

Promise.all(massivPromis).then((res) => { console.log(res) });

// Завдання 2

// "Змагання промісів"

// Ви маєте набір функцій, які повертають проміси з випадковими затримками. Ваше завдання — виконати всі проміси одночасно за допомогою Promise.race і отримати результат найшвидшого проміса.

// Створіть функцію randomDelay, яка приймає значення і повертає проміс з випадковою затримкою (від 1000 до 5000 мілісекунд).
// Створіть масив з 5 промісів, використовуючи функцію randomDelay, із різними значеннями.
// Використайте Promise.race, щоб виконати всі проміси з масиву і отримати результат найшвидшого проміса.
// Обробіть результат найшвидшого проміса та виведіть його у консоль.

const randomDelay = (value) => {
  const deley = Math.floor(Math.random() * (5000 - 1000) + 1000);
  return new Promise((res) => {
    setTimeout(() => {
      res(value);
    }, deley);
  });
};

const masPromis = [
  randomDelay("проміс 1"),
  randomDelay("проміс 2"),
  randomDelay("проміс 3"),
  randomDelay("проміс 4"),
  randomDelay("проміс 5"),
];

Promise.race(masPromis).then((res) => console.log(res));
